Stupid-Git/Cyclone-Lin/Cyclone_Open_2_4_4/third_party/nxp/devices/mimxrt1166/drivers/fsl_snvs_lp.c
            /* Route TX to external tamper 5 */
            base->LPATRC1R |= SNVS_LPATRC1R_ET5RCTL(config.activeTamper);

            /* enable tamper pin */
            base->LPTDC2R |= SNVS_LPTDC2R_ET5_EN_MASK;
            break;
        case (kSNVS_ExternalTamper6):
            /* Enable filter and set it's value if set */
            if (config.filterenable != 0U)
            {
                /* Set filter value */
                SNVS->LPTGF1CR |= SNVS_LPTGF1CR_ETGF6(config.filter);
                /* Enable tamper 6 glitch filter */
                SNVS->LPTGF1CR |= SNVS_LPTGF1CR_ETGF6_EN(1U);
            }

            /* Route TX to external tamper 6 */
            base->LPATRC1R |= SNVS_LPATRC1R_ET6RCTL(config.activeTamper);

            /* enable tamper pin */
            base->LPTDC2R |= SNVS_LPTDC2R_ET6_EN_MASK;
            break;
        case (kSNVS_ExternalTamper7):
            /* Enable filter and set it's value if set */
            if (config.filterenable != 0U)
            {
                /* Set filter value */
                SNVS->LPTGF2CR |= SNVS_LPTGF2CR_ETGF7(config.filter);
                /* Enable tamper 6 glitch filter */
                SNVS->LPTGF2CR |= SNVS_LPTGF2CR_ETGF7_EN(1U);
            }

            /* Route TX to external tamper 7 */
            base->LPATRC1R |= SNVS_LPATRC1R_ET7RCTL(config.activeTamper);

            /* enable tamper pin */
            base->LPTDC2R |= SNVS_LPTDC2R_ET7_EN_MASK;
            break;
        case (kSNVS_ExternalTamper8):
            /* Enable filter and set it's value if set */
            if (config.filterenable != 0U)
            {
                /* Set filter value */
                SNVS->LPTGF2CR |= SNVS_LPTGF2CR_ETGF8(config.filter);
                /* Enable tamper 8 glitch filter */
                SNVS->LPTGF2CR |= SNVS_LPTGF2CR_ETGF8_EN(1U);
            }

            /* Route TX to external tamper 8 */
            base->LPATRC1R |= SNVS_LPATRC1R_ET8RCTL(config.activeTamper);

            /* enable tamper pin */
            base->LPTDC2R |= SNVS_LPTDC2R_ET8_EN_MASK;
            break;
        case (kSNVS_ExternalTamper9):
            /* Enable filter and set it's value if set */
            if (config.filterenable != 0U)
            {
                /* Set filter value */
                SNVS->LPTGF2CR |= SNVS_LPTGF2CR_ETGF9(config.filter);
                /* Enable tamper 9 glitch filter */
                SNVS->LPTGF2CR |= SNVS_LPTGF2CR_ETGF9_EN(1U);
            }

            /* Route TX to external tamper 9 */
            base->LPATRC1R |= SNVS_LPATRC2R_ET9RCTL(config.activeTamper);

            /* enable tamper pin */
            base->LPTDC2R |= SNVS_LPTDC2R_ET9_EN_MASK;
            break;
        case (kSNVS_ExternalTamper10):
            /* Enable filter and set it's value if set */
            if (config.filterenable != 0U)
            {
                /* Set filter value */
                SNVS->LPTGF2CR |= SNVS_LPTGF2CR_ETGF10(config.filter);
                /* Enable tamper 10 glitch filter */
                SNVS->LPTGF2CR |= SNVS_LPTGF2CR_ETGF10_EN(1U);
            }

            /* Route TX to external tamper 10 */
            base->LPATRC1R |= SNVS_LPATRC2R_ET10RCTL(config.activeTamper);

            /* enable tamper pin */
            base->LPTDC2R |= SNVS_LPTDC2R_ET10_EN_MASK;
            break;
#endif
        default:
            status = kStatus_InvalidArgument;
            /* All the cases have been listed above, the default clause should not be reached. */
            break;
    }

    return status;
}

/*!
 * brief Sets voltage tamper detect
 *
 * param base SNVS peripheral base address
 * param enable True if enable false if disable
 */
status_t SNVS_LP_SetVoltageTamper(SNVS_Type *base, bool enable)
{
    base->LPTDCR |= SNVS_LPTDCR_VT_EN(enable);

    return kStatus_Success;
}

/*!
 * brief Sets temperature tamper detect
 *
 * param base SNVS peripheral base address
 * param enable True if enable false if disable
 */
status_t SNVS_LP_SetTemperatureTamper(SNVS_Type *base, bool enable)
{
    SNVS->LPTDCR |= SNVS_LPTDCR_TT_EN(enable);

    return kStatus_Success;
}

/*!
 * brief Sets clock tamper detect
 *
 * param base SNVS peripheral base address
 * param enable True if enable false if disable
 */
status_t SNVS_LP_SetClockTamper(SNVS_Type *base, bool enable)
{
    SNVS->LPTDCR |= SNVS_LPTDCR_CT_EN(enable);

    return kStatus_Success;
}

/*!
 * brief Check voltage tamper
 *
 * param base SNVS peripheral base address
 */
snvs_lp_external_tamper_status_t SNVS_LP_CheckVoltageTamper(SNVS_Type *base)
{
    return ((SNVS->LPSR & SNVS_LPSR_VTD_MASK) != 0U) ? kSNVS_TamperDetected : kSNVS_TamperNotDetected;
}

/*!
 * brief Check temperature tamper
 *
 * param base SNVS peripheral base address
 */
snvs_lp_external_tamper_status_t SNVS_LP_CheckTemperatureTamper(SNVS_Type *base)
{
    return ((SNVS->LPSR & SNVS_LPSR_TTD_MASK) != 0U) ? kSNVS_TamperDetected : kSNVS_TamperNotDetected;
}

/*!
 * brief Check clock tamper
 *
 * param base SNVS peripheral base address
 */
snvs_lp_external_tamper_status_t SNVS_LP_CheckClockTamper(SNVS_Type *base)
{
    return ((SNVS->LPSR & SNVS_LPSR_CTD_MASK) != 0U) ? kSNVS_TamperDetected : kSNVS_TamperNotDetected;
}
#endif /* defined(FSL_FEATURE_SNVS_HAS_ACTIVE_TAMPERS) && (FSL_FEATURE_SNVS_HAS_ACTIVE_TAMPERS > 0) */

/*!
 * brief Get the current Monotonic Counter.
 *
 * param base SNVS peripheral base address
 * return Current Monotonic Counter value.
 */
uint64_t SNVS_LP_GetMonotonicCounter(SNVS_Type *base)
{
    uint32_t mc_lsb, mc_msb;

    mc_msb = base->LPSMCMR;
    mc_lsb = base->LPSMCLR;

    return ((uint64_t)mc_msb << 32UL) | (uint64_t)mc_lsb;
}

/*!
 * brief Write Zeroizable Master Key (ZMK) to the SNVS registers.
 *
 * param base SNVS peripheral base address
 * param ZMKey The ZMK write to the SNVS register.
 */
void SNVS_LP_WriteZeroizableMasterKey(SNVS_Type *base, uint32_t ZMKey[SNVS_ZMK_REG_COUNT])
{
    uint8_t i = 0;

